// 在无限的整数序列 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ...中找到第 n 个数字。

// 注意:
// n 是正数且在32位整数范围内 ( n < 231)。

// 示例 1:
// 输入:
// 3
// 输出:
// 3

// 示例 2:
// 输入:
// 11
// 输出:
// 0

// 说明:
// 第11个数字在序列 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, ... 里是0，它是10的一部分。

// 方法一：思路
// 1位数： 1-9 9个数字
// 2位数： 10-99 9 * 10个数字 9 * 10 * 2个字符
// 3位数： 100-999 9 * 100个数字 9 * 100 * 3个字符
// 解题步骤
// 找到n的区间
// 找到n在此区间中的哪个数字上面
// 找到n在这个数字中的位置并返回

var findNthDigit = function (n) {
  if (n <= 9) return n;

  let i = 1; //几位数
  let num = 9;
  while (n >= num) {
    n -= num;
    i++;
    num = 9 * 10 ** (i - 1) * i;
  }

  //此时n就是i位数里面的第几个字符
  // 然后找到是哪个数字
  n--; //变为下标
  let start = 10 ** (i - 1) + parseInt(n / i) + "";
  return start[n % i];
};

// 方法二
var findNthDigit = function (n) {
  if (n < 10) return n;
  let sum = 10,
    i = 1;
  while (n > sum) {
    n -= sum;
    sum = 9 * Math.pow(10, i) * ++i;
  }
  return (sum / 9 / i + parseInt(n / i) + "")[n % i];
};
